* Timings
  |       | Scheduling works |
  |-------+------------------|
  | T1k   |         0.018119 |
  | T2k   |         0.018191 |
  | T4k   |         0.027442 |
  | T8k   |         0.048465 |
  | T16k  |         0.105867 |
  | T32k  |         0.193492 |
  | T64k  |         0.378044 |
  | T128k |          0.83494 |
* Efficiency
** Schedule first working
   | Number     | Mine | Reference |   Percent |
   |------------+------+-----------+-----------|
   | report1.i  |   41 |        25 |      64.0 |
   | report2.i  |   24 |        23 |       4.3 |
   | report3.i  |   27 |        26 |       3.8 |
   | report4.i  |   50 |        33 |      51.5 |
   | report5.i  |   87 |        25 |     248.0 |
   | report6.i  |  129 |        43 |     200.0 |
   | report7.i  |   87 |        36 |     141.7 |
   | report8.i  |   16 |        15 |       6.7 |
   | report9.i  |   45 |        26 |      73.1 |
   | report10.i |   81 |        40 |     102.5 |
   | report11.i |   81 |        30 |     170.0 |
   | report12.i |   30 |        21 |      42.9 |
   | report13.i |   31 |        25 |      24.0 |
   | report14.i |   23 |        19 |      21.1 |
   | report15.i |   67 |        23 |     191.3 |
   | report16.i |  103 |        57 |      80.7 |
   | report17.i |   32 |        21 |      52.4 |
   | report18.i |   36 |        22 |      63.6 |
   | report19.i |   45 |        42 |       7.1 |
   | report20.i |   69 |        22 |     213.6 |
   | report21.i |   78 |        72 |       8.3 |
   | report22.i |   56 |        52 |       7.7 |
   | report23.i |  100 |        69 |      44.9 |
   |------------+------+-----------+-----------|
   |            |      |           | 79.269565 |
   #+TBLFM: @25$4=vmean(@2$4..@24$4)
** Remove some edges from outputs to stores and loads to stores based on value 
   | Number     | Mine | Reference | Percent |  Previous |   Improve |
   |------------+------+-----------+---------+-----------+-----------|
   | report1.i  |   32 |        25 |    28.0 |      64.0 |      36.0 |
   | report2.i  |   24 |        23 |     4.3 |       4.3 |       0.0 |
   | report3.i  |   27 |        26 |     3.8 |       3.8 |       0.0 |
   | report4.i  |   43 |        33 |    30.3 |      51.5 |      21.2 |
   | report5.i  |   87 |        25 |   248.0 |     248.0 |       0.0 |
   | report6.i  |   98 |        43 |   127.9 |     200.0 |      72.1 |
   | report7.i  |   75 |        36 |   108.3 |     141.7 |      33.4 |
   | report8.i  |   16 |        15 |     6.7 |       6.7 |       0.0 |
   | report9.i  |   45 |        26 |    73.1 |      73.1 |       0.0 |
   | report10.i |   70 |        40 |    75.0 |     102.5 |      27.5 |
   | report11.i |   70 |        30 |   133.3 |     170.0 |      36.7 |
   | report12.i |   30 |        21 |    42.9 |      42.9 |       0.0 |
   | report13.i |   30 |        25 |    20.0 |      24.0 |       4.0 |
   | report14.i |   23 |        19 |    21.1 |      21.1 |       0.0 |
   | report15.i |   60 |        23 |   160.9 |     191.3 |      30.4 |
   | report16.i |   96 |        57 |    68.4 |      80.7 |      12.3 |
   | report17.i |   32 |        21 |    52.4 |      52.4 |       0.0 |
   | report18.i |   36 |        22 |    63.6 |      63.6 |       0.0 |
   | report19.i |   45 |        42 |     7.1 |       7.1 |       0.0 |
   | report20.i |   59 |        22 |   168.2 |     213.6 |      45.4 |
   | report21.i |   78 |        72 |     8.3 |       8.3 |       0.0 |
   | report22.i |   56 |        52 |     7.7 |       7.7 |       0.0 |
   | report23.i |  100 |        69 |    44.9 |      44.9 |       0.0 |
   |------------+------+-----------+---------+-----------+-----------|
   |            |      |           |    65.4 | 79.269565 | 13.869565 |
   #+TBLFM: $4='(format "%.1f" (* 100 (/ (- $2 $3) (float $3))));N::@25$4..@25$6=vmean(@2..@24)::@2$6..@24$6='(format "%.1f" (- $5 $4));N
** Actually use priority values
   | Number     | Mine | Reference |   Percent | Previous |    Improve |
   |------------+------+-----------+-----------+----------+------------|
   | report1.i  |   29 |        25 |      16.0 |     28.0 |       12.0 |
   | report2.i  |   23 |        23 |       0.0 |      4.3 |        4.3 |
   | report3.i  |   26 |        26 |       0.0 |      3.8 |        3.8 |
   | report4.i  |   46 |        33 |      39.4 |     30.3 |       -9.1 |
   | report5.i  |   88 |        25 |     252.0 |    248.0 |       -4.0 |
   | report6.i  |  107 |        43 |     148.8 |    127.9 |      -20.9 |
   | report7.i  |   71 |        36 |      97.2 |    108.3 |       11.1 |
   | report8.i  |   15 |        15 |       0.0 |      6.7 |        6.7 |
   | report9.i  |   45 |        26 |      73.1 |     73.1 |        0.0 |
   | report10.i |   76 |        40 |      90.0 |     75.0 |      -15.0 |
   | report11.i |   76 |        30 |     153.3 |    133.3 |      -20.0 |
   | report12.i |   29 |        21 |      38.1 |     42.9 |        4.8 |
   | report13.i |   29 |        25 |      16.0 |     20.0 |        4.0 |
   | report14.i |   23 |        19 |      21.1 |     21.1 |        0.0 |
   | report15.i |   63 |        23 |     173.9 |    160.9 |      -13.0 |
   | report16.i |   93 |        57 |      63.2 |     68.4 |        5.2 |
   | report17.i |   28 |        21 |      33.3 |     52.4 |       19.1 |
   | report18.i |   33 |        22 |      50.0 |     63.6 |       13.6 |
   | report19.i |   42 |        42 |       0.0 |      7.1 |        7.1 |
   | report20.i |   66 |        22 |     200.0 |    168.2 |      -31.8 |
   | report21.i |   76 |        72 |       5.6 |      8.3 |        2.7 |
   | report22.i |   53 |        52 |       1.9 |      7.7 |        5.8 |
   | report23.i |   76 |        69 |      10.1 |     44.9 |       34.8 |
   |------------+------+-----------+-----------+----------+------------|
   |            |      |           | 64.478261 |     65.4 | 0.92173913 |
   #+TBLFM: $4='(format "%.1f" (* 100 (/ (- $2 $3) (float $3))));N::@25$4..@25$6=vmean(@2..@24)::@2$6..@24$6='(format "%.1f" (- $5 $4));N
** Unserialize stores
   | Number     | Mine | Reference |   Percent |  Previous |   Improve |
   |------------+------+-----------+-----------+-----------+-----------|
   | report1.i  |   29 |        25 |      16.0 |      16.0 |       0.0 |
   | report2.i  |   23 |        23 |       0.0 |       0.0 |       0.0 |
   | report3.i  |   26 |        26 |       0.0 |       0.0 |       0.0 |
   | report4.i  |   37 |        33 |      12.1 |      39.4 |      27.3 |
   | report5.i  |   38 |        25 |      52.0 |     252.0 |     200.0 |
   | report6.i  |   57 |        43 |      32.6 |     148.8 |     116.2 |
   | report7.i  |   46 |        36 |      27.8 |      97.2 |      69.4 |
   | report8.i  |   15 |        15 |       0.0 |       0.0 |       0.0 |
   | report9.i  |   45 |        26 |      73.1 |      73.1 |       0.0 |
   | report10.i |   44 |        40 |      10.0 |      90.0 |      80.0 |
   | report11.i |   34 |        30 |      13.3 |     153.3 |     140.0 |
   | report12.i |   29 |        21 |      38.1 |      38.1 |       0.0 |
   | report13.i |   29 |        25 |      16.0 |      16.0 |       0.0 |
   | report14.i |   23 |        19 |      21.1 |      21.1 |       0.0 |
   | report15.i |   27 |        23 |      17.4 |     173.9 |     156.5 |
   | report16.i |   74 |        57 |      29.8 |      63.2 |      33.4 |
   | report17.i |   23 |        21 |       9.5 |      33.3 |      23.8 |
   | report18.i |   24 |        22 |       9.1 |      50.0 |      40.9 |
   | report19.i |   42 |        42 |       0.0 |       0.0 |       0.0 |
   | report20.i |   66 |        22 |     200.0 |     200.0 |       0.0 |
   | report21.i |   76 |        72 |       5.6 |       5.6 |       0.0 |
   | report22.i |   53 |        52 |       1.9 |       1.9 |       0.0 |
   | report23.i |   76 |        69 |      10.1 |      10.1 |       0.0 |
   |------------+------+-----------+-----------+-----------+-----------|
   |            |      |           | 25.891304 | 64.478261 | 38.586957 |
   #+TBLFM: $4='(format "%.1f" (* 100 (/ (- $2 $3) (float $3))));N::@25$4..@25$6=vmean(@2..@24)::@2$6..@24$6='(format "%.1f" (- $5 $4));N
** Fixed a bug where a store had no dependencies, with REAL priority values
   | Number     | Mine | Reference |   Percent |  Previous |   Improve |
   |------------+------+-----------+-----------+-----------+-----------|
   | report1.i  |   29 |        25 |      16.0 |      16.0 |       0.0 |
   | report2.i  |   27 |        23 |      17.4 |       0.0 |     -17.4 |
   | report3.i  |   31 |        26 |      19.2 |       0.0 |     -19.2 |
   | report4.i  |   34 |        33 |       3.0 |      12.1 |       9.1 |
   | report5.i  |   38 |        25 |      52.0 |      52.0 |       0.0 |
   | report6.i  |   47 |        43 |       9.3 |      32.6 |      23.3 |
   | report7.i  |   43 |        36 |      19.4 |      27.8 |       8.4 |
   | report8.i  |   16 |        15 |       6.7 |       0.0 |      -6.7 |
   | report9.i  |   44 |        26 |      69.2 |      73.1 |       3.9 |
   | report10.i |   41 |        40 |       2.5 |      10.0 |       7.5 |
   | report11.i |   32 |        30 |       6.7 |      13.3 |       6.6 |
   | report12.i |   28 |        21 |      33.3 |      38.1 |       4.8 |
   | report13.i |   29 |        25 |      16.0 |      16.0 |       0.0 |
   | report14.i |   23 |        19 |      21.1 |      21.1 |       0.0 |
   | report15.i |   27 |        23 |      17.4 |      17.4 |       0.0 |
   | report16.i |   74 |        57 |      29.8 |      29.8 |       0.0 |
   | report17.i |   21 |        21 |       0.0 |       9.5 |       9.5 |
   | report18.i |   23 |        22 |       4.5 |       9.1 |       4.6 |
   | report19.i |   42 |        42 |       0.0 |       0.0 |       0.0 |
   | report20.i |   64 |        22 |     190.9 |     200.0 |       9.1 |
   | report21.i |   75 |        72 |       4.2 |       5.6 |       1.4 |
   | report22.i |   53 |        52 |       1.9 |       1.9 |       0.0 |
   | report23.i |   75 |        69 |       8.7 |      10.1 |       1.4 |
   |------------+------+-----------+-----------+-----------+-----------|
   |            |      |           | 23.878261 | 25.891304 | 2.0130435 |
   #+TBLFM: $4='(format "%.1f" (* 100 (/ (- $2 $3) (float $3))));N::@25$4..@25$6=vmean(@2..@24)::@2$6..@24$6='(format "%.1f" (- $5 $4));N
** Keep track of immediate values when they go to RAM
   | Number     | Mine | Reference |   Percent |  Previous |   Improve |
   |------------+------+-----------+-----------+-----------+-----------|
   | report1.i  |   29 |        25 |      16.0 |      16.0 |       0.0 |
   | report2.i  |   27 |        23 |      17.4 |      17.4 |       0.0 |
   | report3.i  |   31 |        26 |      19.2 |      19.2 |       0.0 |
   | report4.i  |   34 |        33 |       3.0 |       3.0 |       0.0 |
   | report5.i  |   38 |        25 |      52.0 |      52.0 |       0.0 |
   | report6.i  |   47 |        43 |       9.3 |       9.3 |       0.0 |
   | report7.i  |   33 |        36 |      -8.3 |      19.4 |      27.7 |
   | report8.i  |   16 |        15 |       6.7 |       6.7 |       0.0 |
   | report9.i  |   44 |        26 |      69.2 |      69.2 |       0.0 |
   | report10.i |   41 |        40 |       2.5 |       2.5 |       0.0 |
   | report11.i |   32 |        30 |       6.7 |       6.7 |       0.0 |
   | report12.i |   28 |        21 |      33.3 |      33.3 |       0.0 |
   | report13.i |   29 |        25 |      16.0 |      16.0 |       0.0 |
   | report14.i |   23 |        19 |      21.1 |      21.1 |       0.0 |
   | report15.i |   27 |        23 |      17.4 |      17.4 |       0.0 |
   | report16.i |   74 |        57 |      29.8 |      29.8 |       0.0 |
   | report17.i |   21 |        21 |       0.0 |       0.0 |       0.0 |
   | report18.i |   23 |        22 |       4.5 |       4.5 |       0.0 |
   | report19.i |   42 |        42 |       0.0 |       0.0 |       0.0 |
   | report20.i |   64 |        22 |     190.9 |     190.9 |       0.0 |
   | report21.i |   75 |        72 |       4.2 |       4.2 |       0.0 |
   | report22.i |   53 |        52 |       1.9 |       1.9 |       0.0 |
   | report23.i |   75 |        69 |       8.7 |       8.7 |       0.0 |
   |------------+------+-----------+-----------+-----------+-----------|
   |            |      |           | 22.673913 | 23.878261 | 1.2043478 |
#+TBLFM: $4='(format "%.1f" (* 100 (/ (- $2 $3) (float $3))));N::@25$4..@25$6=vmean(@2..@24)::@2$6..@24$6='(format "%.1f" (- $5 $4));N
** Priority of max rather than sum of priority
   | Number     | Mine | Reference |   Percent |  Previous |   Improve |
   |------------+------+-----------+-----------+-----------+-----------|
   | report1.i  |   30 |        25 |      20.0 |      16.0 |      -4.0 |
   | report2.i  |   27 |        23 |      17.4 |      17.4 |       0.0 |
   | report3.i  |   30 |        26 |      15.4 |      19.2 |       3.8 |
   | report4.i  |   33 |        33 |       0.0 |       3.0 |       3.0 |
   | report5.i  |   34 |        25 |      36.0 |      52.0 |      16.0 |
   | report6.i  |   46 |        43 |       7.0 |       9.3 |       2.3 |
   | report7.i  |   34 |        36 |      -5.6 |      -8.3 |      -2.7 |
   | report8.i  |   15 |        15 |       0.0 |       6.7 |       6.7 |
   | report9.i  |   44 |        26 |      69.2 |      69.2 |       0.0 |
   | report10.i |   41 |        40 |       2.5 |       2.5 |       0.0 |
   | report11.i |   31 |        30 |       3.3 |       6.7 |       3.4 |
   | report12.i |   28 |        21 |      33.3 |      33.3 |       0.0 |
   | report13.i |   29 |        25 |      16.0 |      16.0 |       0.0 |
   | report14.i |   22 |        19 |      15.8 |      21.1 |       5.3 |
   | report15.i |   28 |        23 |      21.7 |      17.4 |      -4.3 |
   | report16.i |   74 |        57 |      29.8 |      29.8 |       0.0 |
   | report17.i |   23 |        21 |       9.5 |       0.0 |      -9.5 |
   | report18.i |   23 |        22 |       4.5 |       4.5 |       0.0 |
   | report19.i |   42 |        42 |       0.0 |       0.0 |       0.0 |
   | report20.i |   58 |        22 |     163.6 |     190.9 |      27.3 |
   | report21.i |   74 |        72 |       2.8 |       4.2 |       1.4 |
   | report22.i |   52 |        52 |       0.0 |       1.9 |       1.9 |
   | report23.i |   74 |        69 |       7.2 |       8.7 |       1.5 |
   |------------+------+-----------+-----------+-----------+-----------|
   |            |      |           | 20.408696 | 22.673913 | 2.2652174 |
#+TBLFM: $4='(format "%.1f" (* 100 (/ (- $2 $3) (float $3))));N::@25$4..@25$6=vmean(@2..@24)::@2$6..@24$6='(format "%.1f" (- $5 $4));N    
** Don't do stores after stores with nothing in between
   | Number     | Mine | Reference |   Percent |  Previous |   Improve |
   |------------+------+-----------+-----------+-----------+-----------|
   | report1.i  |   30 |        25 |      20.0 |      20.0 |       0.0 |
   | report2.i  |   27 |        23 |      17.4 |      17.4 |       0.0 |
   | report3.i  |   30 |        26 |      15.4 |      15.4 |       0.0 |
   | report4.i  |   33 |        33 |       0.0 |       0.0 |       0.0 |
   | report5.i  |   26 |        25 |       4.0 |      36.0 |      32.0 |
   | report6.i  |   46 |        43 |       7.0 |       7.0 |       0.0 |
   | report7.i  |   34 |        36 |      -5.6 |      -5.6 |       0.0 |
   | report8.i  |   15 |        15 |       0.0 |       0.0 |       0.0 |
   | report9.i  |   44 |        26 |      69.2 |      69.2 |       0.0 |
   | report10.i |   41 |        40 |       2.5 |       2.5 |       0.0 |
   | report11.i |   31 |        30 |       3.3 |       3.3 |       0.0 |
   | report12.i |   28 |        21 |      33.3 |      33.3 |       0.0 |
   | report13.i |   29 |        25 |      16.0 |      16.0 |       0.0 |
   | report14.i |   22 |        19 |      15.8 |      15.8 |       0.0 |
   | report15.i |   28 |        23 |      21.7 |      21.7 |       0.0 |
   | report16.i |   74 |        57 |      29.8 |      29.8 |       0.0 |
   | report17.i |   23 |        21 |       9.5 |       9.5 |       0.0 |
   | report18.i |   23 |        22 |       4.5 |       4.5 |       0.0 |
   | report19.i |   42 |        42 |       0.0 |       0.0 |       0.0 |
   | report20.i |   26 |        22 |      18.2 |     163.6 |     145.4 |
   | report21.i |   74 |        72 |       2.8 |       2.8 |       0.0 |
   | report22.i |   52 |        52 |       0.0 |       0.0 |       0.0 |
   | report23.i |   74 |        69 |       7.2 |       7.2 |       0.0 |
   |------------+------+-----------+-----------+-----------+-----------|
   |            |      |           | 12.695652 | 20.408696 | 7.7130435 |
#+TBLFM: $4='(format "%.1f" (* 100 (/ (- $2 $3) (float $3))));N::@25$4..@25$6=vmean(@2..@24)::@2$6..@24$6='(format "%.1f" (- $5 $4));N
** Algebraic expressions
   | Number     | Mine | Reference |   Percent |  Previous |   Improve |
   |------------+------+-----------+-----------+-----------+-----------|
   | report1.i  |   30 |        25 |      20.0 |      20.0 |       0.0 |
   | report2.i  |   27 |        23 |      17.4 |      17.4 |       0.0 |
   | report3.i  |   30 |        26 |      15.4 |      15.4 |       0.0 |
   | report4.i  |   33 |        33 |       0.0 |       0.0 |       0.0 |
   | report5.i  |   26 |        25 |       4.0 |       4.0 |       0.0 |
   | report6.i  |   46 |        43 |       7.0 |       7.0 |       0.0 |
   | report7.i  |   41 |        36 |      13.9 |      -5.6 |     -19.5 |
   | report8.i  |   15 |        15 |       0.0 |       0.0 |       0.0 |
   | report9.i  |   30 |        26 |      15.4 |      69.2 |      53.8 |
   | report10.i |   41 |        40 |       2.5 |       2.5 |       0.0 |
   | report11.i |   30 |        30 |       0.0 |       3.3 |       3.3 |
   | report12.i |   23 |        21 |       9.5 |      33.3 |      23.8 |
   | report13.i |   29 |        25 |      16.0 |      16.0 |       0.0 |
   | report14.i |   22 |        19 |      15.8 |      15.8 |       0.0 |
   | report15.i |   25 |        23 |       8.7 |      21.7 |      13.0 |
   | report16.i |   54 |        57 |      -5.3 |      29.8 |      35.1 |
   | report17.i |   23 |        21 |       9.5 |       9.5 |       0.0 |
   | report18.i |   20 |        22 |      -9.1 |       4.5 |      13.6 |
   | report19.i |   42 |        42 |       0.0 |       0.0 |       0.0 |
   | report20.i |   25 |        22 |      13.6 |      18.2 |       4.6 |
   | report21.i |   69 |        72 |      -4.2 |       2.8 |       7.0 |
   | report22.i |   51 |        52 |      -1.9 |       0.0 |       1.9 |
   | report23.i |   67 |        69 |      -2.9 |       7.2 |      10.1 |
   |------------+------+-----------+-----------+-----------+-----------|
   |            |      |           | 6.3173913 | 12.695652 | 6.3782609 |
#+TBLFM: $4='(format "%.1f" (* 100 (/ (- $2 $3) (float $3))));N::@25$4..@25$6=vmean(@2..@24)::@2$6..@24$6='(format "%.1f" (- $5 $4));N
** Stores to outputs optimization
   | Number     | Mine | Reference |   Percent |  Previous |    Improve |
   |------------+------+-----------+-----------+-----------+------------|
   | report1.i  |   30 |        25 |      20.0 |      20.0 |        0.0 |
   | report2.i  |   27 |        23 |      17.4 |      17.4 |        0.0 |
   | report3.i  |   30 |        26 |      15.4 |      15.4 |        0.0 |
   | report4.i  |   33 |        33 |       0.0 |       0.0 |        0.0 |
   | report5.i  |   26 |        25 |       4.0 |       4.0 |        0.0 |
   | report6.i  |   46 |        43 |       7.0 |       7.0 |        0.0 |
   | report7.i  |   41 |        36 |      13.9 |      13.9 |        0.0 |
   | report8.i  |   15 |        15 |       0.0 |       0.0 |        0.0 |
   | report9.i  |   30 |        26 |      15.4 |      15.4 |        0.0 |
   | report10.i |   41 |        40 |       2.5 |       2.5 |        0.0 |
   | report11.i |   30 |        30 |       0.0 |       0.0 |        0.0 |
   | report12.i |   23 |        21 |       9.5 |       9.5 |        0.0 |
   | report13.i |   29 |        25 |      16.0 |      16.0 |        0.0 |
   | report14.i |   22 |        19 |      15.8 |      15.8 |        0.0 |
   | report15.i |   25 |        23 |       8.7 |       8.7 |        0.0 |
   | report16.i |   52 |        57 |      -8.8 |      -5.3 |        3.5 |
   | report17.i |   23 |        21 |       9.5 |       9.5 |        0.0 |
   | report18.i |   20 |        22 |      -9.1 |      -9.1 |        0.0 |
   | report19.i |   42 |        42 |       0.0 |       0.0 |        0.0 |
   | report20.i |   25 |        22 |      13.6 |      13.6 |        0.0 |
   | report21.i |   69 |        72 |      -4.2 |      -4.2 |        0.0 |
   | report22.i |   51 |        52 |      -1.9 |      -1.9 |        0.0 |
   | report23.i |   67 |        69 |      -2.9 |      -2.9 |        0.0 |
   |------------+------+-----------+-----------+-----------+------------|
   |            |      |           | 6.1652174 | 6.3173913 | 0.15217391 |
#+TBLFM: $4='(format "%.1f" (* 100 (/ (- $2 $3) (float $3))));N::@25$4..@25$6=vmean(@2..@24)::@2$6..@24$6='(format "%.1f" (- $5 $4));N
** Improved priority function
   | Number     | Mine | Reference |   Percent |  Previous |     Improve |
   |------------+------+-----------+-----------+-----------+-------------|
   | report1.i  |   28 |        25 |      12.0 |      20.0 |         8.0 |
   | report2.i  |   24 |        23 |       4.3 |      17.4 |        13.1 |
   | report3.i  |   27 |        26 |       3.8 |      15.4 |        11.6 |
   | report4.i  |   33 |        33 |       0.0 |       0.0 |         0.0 |
   | report5.i  |   26 |        25 |       4.0 |       4.0 |         0.0 |
   | report6.i  |   45 |        43 |       4.7 |       7.0 |         2.3 |
   | report7.i  |   43 |        36 |      19.4 |      13.9 |        -5.5 |
   | report8.i  |   16 |        15 |       6.7 |       0.0 |        -6.7 |
   | report9.i  |   30 |        26 |      15.4 |      15.4 |         0.0 |
   | report10.i |   43 |        40 |       7.5 |       2.5 |        -5.0 |
   | report11.i |   36 |        30 |      20.0 |       0.0 |       -20.0 |
   | report12.i |   23 |        21 |       9.5 |       9.5 |         0.0 |
   | report13.i |   29 |        25 |      16.0 |      16.0 |         0.0 |
   | report14.i |   23 |        19 |      21.1 |      15.8 |        -5.3 |
   | report15.i |   26 |        23 |      13.0 |       8.7 |        -4.3 |
   | report16.i |   52 |        57 |      -8.8 |      -8.8 |         0.0 |
   | report17.i |   24 |        21 |      14.3 |       9.5 |        -4.8 |
   | report18.i |   20 |        22 |      -9.1 |      -9.1 |         0.0 |
   | report19.i |   43 |        42 |       2.4 |       0.0 |        -2.4 |
   | report20.i |   25 |        22 |      13.6 |      13.6 |         0.0 |
   | report21.i |   69 |        72 |      -4.2 |      -4.2 |         0.0 |
   | report22.i |   50 |        52 |      -3.8 |      -1.9 |         1.9 |
   | report23.i |   67 |        69 |      -2.9 |      -2.9 |         0.0 |
   |------------+------+-----------+-----------+-----------+-------------|
   |            |      |           | 6.9086957 | 6.1652174 | -0.74347826 |
#+TBLFM: $4='(format "%.1f" (* 100 (/ (- $2 $3) (float $3))));N::@25$4..@25$6=vmean(@2..@24)::@2$6..@24$6='(format "%.1f" (- $5 $4));N
** More improvements
   | Number     | Mine | Reference |   Percent |  Previous |   Improve |
   |------------+------+-----------+-----------+-----------+-----------|
   | report1.i  |   27 |        25 |       8.0 |      12.0 |       4.0 |
   | report2.i  |   23 |        23 |       0.0 |       4.3 |       4.3 |
   | report3.i  |   26 |        26 |       0.0 |       3.8 |       3.8 |
   | report4.i  |   33 |        33 |       0.0 |       0.0 |       0.0 |
   | report5.i  |   26 |        25 |       4.0 |       4.0 |       0.0 |
   | report6.i  |   45 |        43 |       4.7 |       4.7 |       0.0 |
   | report7.i  |   40 |        36 |      11.1 |      19.4 |       8.3 |
   | report8.i  |   15 |        15 |       0.0 |       6.7 |       6.7 |
   | report9.i  |   30 |        26 |      15.4 |      15.4 |       0.0 |
   | report10.i |   41 |        40 |       2.5 |       7.5 |       5.0 |
   | report11.i |   30 |        30 |       0.0 |      20.0 |      20.0 |
   | report12.i |   21 |        21 |       0.0 |       9.5 |       9.5 |
   | report13.i |   29 |        25 |      16.0 |      16.0 |       0.0 |
   | report14.i |   23 |        19 |      21.1 |      21.1 |       0.0 |
   | report15.i |   23 |        23 |       0.0 |      13.0 |      13.0 |
   | report16.i |   52 |        57 |      -8.8 |      -8.8 |       0.0 |
   | report17.i |   22 |        21 |       4.8 |      14.3 |       9.5 |
   | report18.i |   20 |        22 |      -9.1 |      -9.1 |       0.0 |
   | report19.i |   43 |        42 |       2.4 |       2.4 |       0.0 |
   | report20.i |   25 |        22 |      13.6 |      13.6 |       0.0 |
   | report21.i |   69 |        72 |      -4.2 |      -4.2 |       0.0 |
   | report22.i |   50 |        52 |      -3.8 |      -3.8 |       0.0 |
   | report23.i |   67 |        69 |      -2.9 |      -2.9 |       0.0 |
   |------------+------+-----------+-----------+-----------+-----------|
   |            |      |           | 3.2521739 | 6.9086957 | 3.6565217 |
#+TBLFM: $4='(format "%.1f" (* 100 (/ (- $2 $3) (float $3))));N::@25$4..@25$6=vmean(@2..@24)::@2$6..@24$6='(format "%.1f" (- $5 $4));N

